[Main]
DisplayName=Romanian

[Uninstaller_frmIObitUninstall]
RdImageButton_Software.caption=Programe
RdImageButton_Browser.caption=Barele de instrumente && Plug-in-uri
RdImageButton_Metro.caption=Windows Apps
lbl_ForcedUninstall.caption=Dezinstalează Forțat
lbl_likeIObit.caption=Îmi Place
PopMenu_Sub_Setting.caption=Setări...
PopMenu_Sub_FileShredder.caption=Toacă Fișierele
PopMenu_Sub_ExportApplicationList.caption=Exportă lista cu aplicații
PopMenu_Sub_LogManagement.caption=Administrare Jurnal
PopMenu_Sub_Update.caption=Verifică pentru actualizări
PopMenu_Sub_UserManual.caption=Manualul de utilizare
PopMenu_Sub_TechnicalSupport.caption=Suport Tehnic
PopMenu_Sub_IObitOnline.caption=Pagina web IObit
PopMenu_Sub_About.caption=Despre
Menu_Plugins_Remove.caption=Șterge
Menu_plugins_Vote.caption=Votează
Menu_plugins_Refresh.caption=Reînprospătează
Menu_plugins_viewEntry.caption=Deschide în RegEdit
Menu_plugins_OpenFile.caption=Deschide Locația Fișierului
Menu_Plugins_SelectAll.caption=Selectează Tot
Menu_Plugins_InverseSelect.caption=Inversează Selecția
PopMenu_Uninstall.caption=Dezinstalează
PopMenu_Refresh.caption=Reînprospătează
PopMenu_ViewStyle.caption=Vezi cu
PopMenu_ViewStyle_Icon.caption=Pictograme
PopMenu_ViewStyle_Details.caption=Detalii
PopMenu_OpenFolder.caption=Deschide Locația Fișierului
PopMenu_ViewEntry.caption=Deschide în RegEdit
PopMenu_SearchOnline.caption=Caută pe web
PopMenu_Win8App_Uninstall.caption=Dezinstalează
PopMenu_Win8App_Refresh.caption=Reînprospătează
PopMenu_Win8App_ViewStyle.caption=Vezi cu
PopMenu_Win8App_Icons.caption=Pictograme
PopMenu_Win8App_Details.caption=Detalii
PopMenu_Win8App_OpenLocation.caption=Deschide Locația Fișierului
PopMenu_Win8App_ViewEntry.caption=Deschide în RegEdit
PopMenu_Win8App_SearchOnline.caption=Caută pe web
lbl_Recommend.caption=Recomandare: Advanced SystemCare
lbl_1Click.caption=Protejează și optimizează cu un 1-Click PC-ul dvs.
lbl_Freedownloadnow.caption=Descarcă gratuit acum
lbl_News_DisConnection.caption=Partajează acest software în familiile și prietenilor. Ei vor fi fericiți că folosesc programul nostru de dezinstalare!

[Uninstaller_Frame_Software]
lblLoading.caption=Încarcă Actualizările Windows
ListView_SoftwareList.Columns[1].Caption=Operațiune
ListView_SoftwareList.Columns[2].Caption=Dimensiune
ListView_SoftwareList.Columns[3].Caption=Data Instalării
ListView_SoftwareList.Columns[4].Caption=Versiune
PopMenu_Sub_BatchUninstall.Caption=Dezinstalează Lotul

[Uninstaller_frmForcedUninstall]
lbl_Caption.caption=Dezinstalează Forțat
lbl_Detail_Title.caption=IObit Dezinstalarea Forțată
lbl_Detail_Detail.caption=Dezinstalarea forțată vă ajută să dezinstalați un program care nu poate fi dezinstalat în mod normal și curăță resturile sale bine. Acesta vă poate ajuta, de asemenea, să eliminați un fișier și dosare țintă ușor.
RdImageButton_Browser.caption=Caută...
lbl_Forced_Tip1.caption=Puteți căuta sau plasa aici un fișier sau folder pentru a fi șters sau să dezinstalați un program.
lbl_Forced_Tip2.caption=Apoi faceți clic pe butonul "Înainte" pentru a începe procesul de dezinstalare forțată.
RdImageButton_Next.caption=Înainte
RdImageButton_Cancel.caption=Anulare
PopMenu_Uninstall.caption=Dezinstalează
PopMenu_OpenFolder.caption=Deschide Directorul Fișierului
PopMenu_ViewEntry.caption=Vezi Intrarea
PopMenu_SearchOnline.caption=Caută pe web
ListView_Search.Columns[0].caption=Numele De Afișare
ListView_Search.Columns[1].caption=Dimensiune
ListView_Search.Columns[2].caption=Data Instalării

[Uninstaller_frmLogManage]
lbl_Caption.caption=Administrează Jurnalul Dezinstalării
lbl_Detail_Title.caption=IObit Uninstaller Jurnalul Fișierului din Lista
lbl_Detail_Detail.caption=Puteți vizualiza și gestiona toate jurnalele de dezinstalare de mai jos.
RdImageButton_Open.caption=Deschide
RdImageButton_Delete.caption=Șterge
RdImageButton_DeleteAll.caption=Șterge Tot
RdImageButton_Cancel.caption=Anulare

[Uninstaller_frmUninstallButton]
lbl_Plugin_Remove.caption=Șterge
lbl_Software_Uninstall.caption=Dezinstalează

[Uninstaller_frmUninstalling]
lbl_Caption.caption=Dezinstalatorul IObit
lbl_UninstallComplete_Title.caption=Dezinstalarea Standard sa terminat.
lbl_Uninstalling_question.caption=Vrei să dezinstalezi programul selectat?
lbl_PowerfulScan_Title.caption=Scanează Profund
lbl_PowerfulScan_Detaill.caption=Clichează pe Scanează Profund pentru a curăța resturile programului. Clichează pe Anulare pentru a încheia.
lbl_PowerScan_Title_Softwre.caption=Scanez Profund
lbl_CreateRestore_Title.caption=Crează o copie de rezervă înainte de dezinstalarea
lbl_CreateRestore_Check.caption=Crează un punct de restaurare înainte de a dezinstala (Aceasta va dura ceva timp).
lbl_CreateRestore_Detaill.caption=Crează un punct de restaurare aici și aveți posibilitatea să anulați modificările,înainte să se întâmple ceva neașteptat.
lbl_AutoPowerfulScan.caption=Scanează Profund în mod automat
lbl_AutoUninstaller.caption=Nu mai arată această notificare
RdImageButton_Uninstall.caption=Dezinstalează
RdImageButton_PowerFulScan.caption=Scanează Profund
RdImageButton_Cancel.caption=Anulare

[Uninstaller_frmPowerScan]
lbl_Caption.caption=Scanează Profund
lbl_Warning_Title.caption=Atenție:
lbl_Warning_Detail.caption=Mai multe programe sau detectat în acest director. Vă rugăm să fiți precauți atunci când selectați un element pentru a fi șters.
lbl_FileShredder.caption=Asemenea, toacă fișierele
lbl_SelectAll.caption=Selectează Tot
RdImageButton_Delete.caption=Șterge
RdImageButton_Cancel.caption=Anulare
lbl_Shredder_Tip.caption=Se distrug fișierele acum. Aceasta poate dura ceva timp, va rugam asteptati ...
Menu_ListView_Regedit.caption=Deschide în RegEdit
Menu_ListView_Path.caption=Deschide Locația Fișierelor

[Uninstaller_frmAbout]
lbl_Warnning_Title.caption=Atenție
lbl_Warnning_Detaill.caption=Acest program de calculator este protejat de legea dreptului de autor și tratatele internaționale.
lbl_copyright.caption=Copyright© 2005-2015 IObit. Toate drepturile rezervate.
lbl_Thanks_Title.caption=Mulțumiri speciale următoarelor persoane pentru contribuțiile lor mari:

[Uninstaller_frmSetting]
lbl_Caption.caption=Setări
lbl_General.caption=Generale
lbl_AutoUninstaller.caption=Sari peste notificarea de confirmare a dezinstalării și creierii punctului de restaurare
lbl_AutoPowerfulScan.caption=Efectuează în mod automat o scanare profundă
lbl_ShowExplorerButton.caption=Adauga butonul Tocare Fișier în Explorer
lbl_AutoShowTipForm.caption=Utilizează-Scanează Profund când o operație de dezinstalare a fost detectată
lbl_Language.caption=Limbă
lbl_CurrentLanguage_Title.caption=Limba Curentă:
lbl_SkinTitle.caption=Costum:
lbl_classic.caption=Clasic
lbl_Metro.caption=Albastru
RdImageButton_OK.caption=Bine
RdImageButton_Cancel.caption=Anulare

[Uninstaller_frmFileShredder]
lbl_Caption.caption=Tocatorul Fișierelor
lbl_Detail_Detail.caption=După cum știți, fișierele șterse de pe PC-ul dvs. pot fi recuperate chiar si dupa formatarea discului. Îndepărtarea normală șterge numai numele fișierului fără a atinge conținutul pe motiv de performanță. Dacă aveți fișiere importante și trebuie să fie eliminate definitiv folosește IObit Uninstaler acesta te va ajuta cu "Tocătorul Fișierelor".
lbl_Listview_Title.caption=Selectează fișierul sau directorul pe care doriți să-l tocați:
lblLoading.caption=Se încarcă...
lbl_AddFile.caption=Adaugă fișiere...
lbl_AddFolder.caption=Adaugă un folder...
RdImageButton_Shredder.caption=Toacă
RdImageButton_Cancel.caption=Anulare
ListView_FileList.Columns[0].Caption=Cale Fișier
Menu_Shredder_Shredder.caption=Tocare
Menu_Shredder_AddFile.caption=Adaugă Fișiere
Menu_Shredder_AddFolder.caption=Adaugă un Folder
Menu_Shredder_Romove.caption=Șterge
Menu_Shredder_Clean.caption=Curăță
lbl_Shredder_Tip.caption=Distrug fișierele acum. Aceasta poate dura ceva timp, va rugam asteptati ...

[Uninstaller_frmSystemRestore]
lbl_Caption.caption=Restaurare Sistem
lbl_Detail_Title.caption=Restaurare Sistem
lbl_Detail_Detail.caption=Administrează Restaurarea Sistemului și punctele de restaurare. Cel mai recent creat nu poate fi șters pentru siguranța sistemului.
ListView_Restore.Columns[0].caption=Data și ora
ListView_Restore.Columns[1].caption=Descriere
lbl_Restore_Tip.caption=Restaurez fișierele de sistem și setările, va rugam asteptati ...
RdImageButton_Restore.caption=Restaurează
RdImageButton_Delete.caption=Șterge
RdImageButton_Cancel.caption=Anulare

[Uninstaller_frmInstallerSetup]
lbl_Installer_Setup_Title.caption=Cel mai puternic program de dezinstalare și eliminare Aplicații && Barele de instrumente nedorite 
lbl_Installer_Setup_Title1.caption=Cel mai puternic program de dezinstalare și eliminare Barele de instrumente && Aplicații nedorite 
RdImageButton_Installer.caption=Rulează Acum
lbl_Installer_Setup_Detail.caption=Citeste și Acceptă
lbl_LicenseAgreement.caption=Acordul de licență

[Uninstaller_frmInstaller_EULA]
lbl_Caption.caption=Acord de licență
RdImageButton_Cancel.caption=Închide

[Uninstaller_fraBrowserCleaner]
rdibtnAllBrowses.Caption=Toate Barele de instrumente și plugin-urile
rdlvAllBrowse.Columns[0].Caption=Nume
rdlvAllBrowse.Columns[1].Caption=Evaluare Utilizator
rdlvAllBrowse.Columns[2].Caption=Evaluarea Mea
rdlvAllBrowse.Columns[3].Caption=Distribuitor
rdlvAllBrowse.Columns[4].Caption=Operațiune
rdlvCustomBrowse.Columns[0].Caption=Nume
rdlvCustomBrowse.Columns[1].Caption=Distribuitor

[Uninstaller_frmPluginVote]
lblTitle.Caption=Evaluare
lblWaiting.Caption=Trimit Evaluarea, va rugam asteptati ...
rdibtnLv1.Caption=1 Stea
rdibtnLv2.Caption=2 Stele
rdibtnLv3.Caption=3 Stele
rdibtnLv4.Caption=4 Stele
rdibtnLv5.Caption=5 Stele
rdibtnVote.Caption=Evaluare

[Uninstaller_frmRestBrowserDefault]
lblTitle.Caption=Setări Implicite
lblConfire.Caption=Sigur vrei să restabilești la setările implicite?
lblHomepageTitle.Caption=Pagina web Curentă:
lblSearchTitle.Caption=Motorul Curent de căutare implicit:
rdibtnOK.Caption=Bine
rdibtnCancel.Caption=Anulare

[Uninstaller_Frame_Win8App]
ListView_AppList.Columns[0].caption=Nume
ListView_AppList.Columns[1].caption=Operator
ListView_AppList.Columns[2].caption=Dimensiune
ListView_AppList.Columns[3].caption=Data Instalării
ListView_AppList.Columns[4].caption=Versiune
PopMenu_Sub_BatchUninstall.caption=Dezinstalează Lotul 
lblLoading.caption=Reînprospătez...

[Uninstaller_frmWinAppUninstaller_ASK]
lblHit.caption=Aceste aplicații sunt legate între ele. Dezinstalarea uneia dintre ele le va dezinstala pe toate celelalte. Sigur dorești să le dezinstalezi?
lblUninstalling.caption=Dezinstalez
btnImgUninstall.caption=Dezinstalează
btnImgCancle.caption=Anulare

[uninstall_Mitor_M]
lbl_attention.caption=Atenție
lbl_show.caption="%s" mai are încă resturi, care pot afecta performanța PC-ului.
lbl_again.caption=Nu mai arata acest mesaj din nou.
img_power.caption=Curăță Acum

[Uninstaller_M]
Edit_Search_Tip=Caută programe
Edit_Search_Tip_Toolbar=Cauta bare de instrumente sau plug-inuri
Edit_Search_Tip_Win8App=Cauta Windows App
ForcedUninstall_Browser_Tip=Cale nevalidă. Vă rugăm să selectați din nou!
ListView_Icon_Hint=Pictograme
ListView_List_Hint=Detalii
ListView_View_Hint=Schimbă vizualizarea
ListviewHeader_Software=Numele programului (Total: %d)
BatchUninstall_NoneSelect=Selectează cel puțin un program.
Uninstall_NoneSelect=Vă rugăm să selectați primul program.
WindowState_Max=Maximizează
WindowState_Normor=Restaurează
WindowState_Min=Minimizează
Close=Închide
MoreMenu_Setting=Mai multe Setări
Restore_Form=Restaurează
Log_DeleteAll_ASK=Sigur dorești să ștergi toate fișierele? Recuperarea lor nu va fi posibilă dacă le elimini.
Log_Delete_ASK=Sigur dorești să ștergi fișierul selectat?Recuperarea lui nu va fi posibilă dacă îl elimini.
NoPowerfulScan_Found_Tip=Nu sa găsit nici un element la Scanarea Profundă.
Log_M=Jurnal
App_Version_M=versiune Program:
OS_Version_M=Sistemul de Operare:
Date_M=Dată
Version_M=Versiune
Publisher_M=Distribuitor
Install_Date_M=Data Instalării
Create_Restore_M=Crează un punct de restaurare
CreateRestore_Title_M=Crează un punct de restaurare apoi dezinstalează.
CreateRestore_Detaill_M=Poți anula modificările cu un punct de restaurare înainte să se întâmple ceva neașteptat.
Uninstalling_M=Dezinstalez
Uninstalling_Detaill_M=Utilizând Dezinstalarea standard vei rula dezinstalatorul aplicatiei creat la instalare.
Uninstalling_QuickDetaill_M=Utilizând Dezinstalarea rapida vei rula dezinstalatorul aplicatiei creat la instalare.
UninstallComplete_Title_M=Șterge Fișierele.
Quick_UninstallComplete_M=Dezinstalarea Rapidă sa terminat.
Quick_Uninstall_M=Dezinstalează Rapid %s (%d/%d)
Standard_Uninstall_M=Dezinstalează Normal %s (%d/%d)
Uninstall_M=Dezinstalează %s (1/1)
Deselect_All_M=Deselectează All
Select_All_M=Selectează Tot
PowerfulScan_DeleteASK_M=Sigur dorești să ștergi elementele selectate?
Operation_M=Operațiune
Powerful_Scan_M=Scanează Profund
Deleted_Registry_Key_M=Șterge Cheile de Registru
Deleted_Registry_Value_M=Șterge Cheile de Registru Valorice
Delete_File_M=Șterge Fișierele
Delete_Folder_M=Șterge Folderul
Reboot_to_Delete_M=(Șterge la Repornirea Windows-ului)
Delete_finished_M=Felicitări! Resturile au fost șterse cu succes.
ReStartup_to_Delete_M=Fișierele rămase din lista vor fi șterse la repornirea sistemului.
Shredder_Del_M=Sigur dorești să elimini definitiv acest fișier %d? Va fi absolut IRECUPERABIL dacă îl elimini și va dura mai mult timp până la finalizare.
Shredder_NotDel_M="%s" nu au fost tocate, nu sa reușit scrierea lor deoarece acestea sunt doar în citire. Vă rugăm să verificați dacă acestea sunt încă în uz.
Shredder_InUse_M=Unele fișiere nu au fost mărunțite deoarece acestea sunt în imposibilitatea de a fi scrise. Vă rugăm să verificați dacă acestea sunt încă în uz.
Shredder_NotAddFolder_M=Nu se poate toca în bucăți aceste fișiere "%s",această operațiune poate provoca instabilitatea sistemului.
Shredder_Sucess_M=Fișierele au fost tocate cu succes.
Shredder_DirIsEmpty_M=Acestea sunt goale. Nu se pot toca.
Controlpanel_Button=Dezinstalează Profund
Explorer_Button=Toacă Fișierele
MenuRight_Caption=Dezinstalează Profund
Frequency_M=Frecvența de utilizare
InstallerDate_M=Data Instalării
Frequency_SoftwareCount_M=<a>%s</a> au fost găsite programe folosite rar. Dezinstalarea le va elibera <a>%s</a> pentru a optimiza performanțele PC-ului.
Frequency_DaysHint_M=Nu este folosit de %s zile.
SearchLoadingMsg=Caut barele de instrumente && plug-in-urile...
RestoreDefaultSettingsButton=Restaurez %s la Setările implicite
ListViewItemVote=Evaluare
ListViewItemVoted=Evaluat
ListViewItemTrust=Sigur
ListViewItemUnTrust=Nesigur
ListViewPlugSysbit=biți
ListViewGroupTrustTitle=Barele de instrumente și Plug-in-urile sigure
ListViewGroupTrustDesc=Aceste bare de instrumente și plug-in-uri nu vor dăuna computerului dumneavoastră. Le puteți elimina sau menține după cerințele dvs..
ListViewGroupUnTrustTitle=Recomandare elimină Barele de instrumente și Plug-in-urile nesigure
ListViewGroupUnTrustDesc=Aceste bare de instrumente și plug-in-uri cu evaluări mici pot conține anumite funcții nedorite.
ListViewGroupToolbar=Bare de instrumente
ListViewGroupBHO=BHO
ListViewGroupActiveX=ActiveX
ListViewGroupExtensions=Extensii
ListViewGroupPlugins=Plug-in-uri
FuncCheckBrowserMsgBox_1=%s se execută
FuncCheckBrowserMsgBox_2=Clichează pe Bine pentru închidere (cu excepția primului conținut).
FuncCheckBrowserMsgBox_3=Sau faceți clichează pe Anulare pentru a ieși din operațiune.
FuncPluginRmoveConfireMsgBox=Ești sigur că dorești să elimini elementele selectate?
FuncPluginRemoveSuccessMsgBox=Articole au fost eliminate cu succes
FuncPluginRemoveFailedMsgBox_1=Nu sa reușit eliminarea următoarelor elemente:
FuncPluginRemoveFailedMsgBox_2=Vă rugăm să ieșiți din următoarele browsere pentru a elimina elementele:
FuncPluginRemoveFailedMsgBox_3=Vă rugăm să ieșiți din browser și încercați din nou.
FuncPluginSelectMsgBox=Vă rugăm să selectați primul element
FuncVoteConfire=Ce crezi despre acest program:
FuncVoteHavedVote=Ați evaluat deja
FuncVotePlugSelectMsgBox=Vă rugăm să selectați un articol pentru al evalua
FuncVoteMarkSelectMsgBox=Vă rugăm să evaluați.
FuncVoteFailedMsgBox=Evaluarea nu a reușit, vă rugăm să verificați conexiunea la rețea și încercați din nou.
FuncRestoreExitBrowserMsgBox=Vă rugăm să închizi în primul rând %s
FuncRestoreSuccessMsgBox=Browser restaurat cu succes la setările implicite
FuncRestoreFailedMsgBox=Eșec la restaurarea setărilor implicite ale browser-ului, vă rugăm să închizi %s și încercați din nou.
Guest_Start_Tip=Ești autentificat în sistem cu un cont de invitat! Ai nevoie de drepturi administrative pentru a utiliza IObit Uninstaller.
p_RegistryCaption_M=Registri
p_FileCaption_M=Fișiere
p_FormatOneItem_M=1 articol
p_FormatItems_M=%d articole
FuncVoteActiveVote=Evaluare
FuncVoteActiveOK=Bine
FuncVoteNothing=Nimeni nu ai evaluat încă
FuncVoteCount=în prezent aceste persoane au evaluat deja
FuncVoteVSA=Nu sa primit încă o evaluare
FuncVoteCFA=Fii primul care evaluează
FuncVoteVSB=utilizatorii au evaluat
FuncVoteCFB=Ce crezi despre acest plug-in
FuncVoteVSC=Nu sa încă primit o evaluare de la alții
FuncVoteCFC=Ai evaluat deja
FuncVoteVSD=utilizatorii au evaluat
FuncVoteCFD=Ai evaluat deja
AllBrowserItem=Toate barele de instrumente & Plug-in-urile
Powerful_Tip_M=Scanează profund resturile rămase "%s"
Setup_Win8_Detail_M=Asistență la Dezinstalare rapidă și dezinstalarea Windows Apps 
Setup_Notwin8_Detail_M=Asistență la Dezinstalare rapidă
RestrorePoint_Tip_M=ATENȚIE: Restaurarea sistemului de la un punct de restaurare va anula toate modificările efectuate după acel punct de restaurare. Odată început, Restaurare sistemului nu poate fi anulată sau întreruptă. Sigur doriți să continuați?
RestorePoint_Restart_M=System Restore trebuie să repornească computerul pentru a aplica aceste modificări. Înainte de a începe, salvați toate fișierele deschise și închideți toate programele.
Uninstaller_Quick_M=Dezinstalează Rapid
Uninstaller_Standed_M=Dezinstalează
QuickUninstall_Tip_M=Dezinstalează programul cu doar un singur clic
Frequency_SoftwareCount_M=<a>%s</a> programe folosite rar găsite. Dezinstalarea le va elibera <a>%s</a> pentru a optimiza performanțele PC-ului.
Frequency_DaysHint_M=Nu sau folosit de %s zile.
InfrequentlyUsed_Count_M=Folosit Ocazional ( <a>%s</a> )
All_Programs_M=Toate Programele
Recently_Installed_M=Recent Instalate
Large_Programs_M=Programe Mari
Infrequently_Used_M=Folosit Ocazional
Windows_Updates_M=Actualizări Windows
FuncCheckBrowserMsgBox_1=%s se execută
FuncCheckBrowserMsgBox_2=Clichează pe Bine pentru a închide (cu excepția primului conținut).
FuncCheckBrowserMsgBox_3=Clichează pe Anulare pentru a abandona această operațiune
FuncCheckBrowserMsgBox_4=%s ecestea sunt în funcționare
FuncCheckBrowserMsgBox_5=Clichează pe Bine pentru a le opri forțat (cu excepția primului conținut).
FuncCheckBrowserMsgBox_6=Clichează pe Anulare pentru a abandona această operațiune
Win8OtherUser=Pentru a afișa Windows Apps,asigurați-vă că contul curent are drepturi administrative.
Win8AdminUser=Vă ajută să dezinstalați aplicații complet și curăță resturile nedorite din Windows Apps cu un singur clic.
Win8ListViewGroupsWin8AppHeader=Windows Apps
Win8ListViewGroupsWin8AppSubtitle=Aplicațiile sunt publicate de către Microsoft Corporation.
Win8ListViewGroupsThirdHeader=Aplicații terțe
Win8ListViewGroupsThirdSubtitle=Aplicațiile sunt publicate de societățile terță parte.
win8_UninstallBtn_M=Dezinstalează
win8_ListViewIcon_M=Vezi Pictogramele
win8_ListViewList_M=Vezi Detaliile

[ACD_frmDownloader]
lbl_Cancel.Caption=Anulare
lbl_Min.Caption=Minimizează

[ACD_M]
M_Downloading=Descarc:
m_Installing=Instalez:
M_DiskIsFull=Spațiu pe disc insuficient!
M_NetError=Eroare de rețea.Te rog să încerci din nou mai târziu.
M_Tips=Descărcarea este în proces. Clichează pictograma pentru a vedea detaliile.
M_TipDownLoading=Descarc
M_TipInstalling=Instalez
M_MD5Faild=Fișierul descărcat este corupt. Te rog să încerci din nou mai târziu.
M_AreSure=Ești sigur că dorești să ieși din Downloader?
M_Speed=Viteză:
M_Title=IObit Downloader

